# ScheduleFieldId Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleFieldId Members
ScheduleFieldId Class Constructors Methods Operators Properties See Also
---
The ScheduleFieldId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ScheduleFieldId | Initializes a new instance of the ScheduleFieldId class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetHashCode | Gets the integer value of the id as hash code  (Overrides Object..::..GetHashCode()()()().) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Gets a String representation of the integer value of the id.  (Overrides Object..::..ToString()()()().) |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two ScheduleFieldIds are the same. |
| Inequality | Determines whether two ScheduleFieldId are different. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IntegerValue | Provides the value of the ScheduleFieldId as an integer. |
| InvalidScheduleFieldId | Get the invalid ScheduleFieldId whose IntegerValue is -1. |

# See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace